{
  "id": "exercise-015-inter-vlan-routing",
  "lessonId": "lesson-015-inter-vlan-routing",
  "title": "Inter-VLAN Routing Lab",
  "description": "Apply Lesson 015 concepts to orchestrate router-on-a-stick and Layer 3 switching deployments across Meridian Logistics' distributed sites, documenting CLI steps, verification commands, and design trade-offs so every VLAN communicates exactly as intended.",
  "difficulty": "advanced",
  "points": 110,
  "language": "text",
  "starterCode": "# Inter-VLAN Routing Lab - Router-on-a-Stick and Layer 3 Switching Scenarios\n# Based on Lesson 015: Inter-VLAN Routing (Router-on-a-Stick & Layer 3 Switches)\n\n================================================================================\nSCENARIO 1: ROUTER-ON-A-STICK FOR A COASTAL BRANCH\n================================================================================\nMeridian Logistics opened a coastal branch that must support 60 corporate desktops, a guest Wi-Fi zone, and 20 IoT sensors that stay in their own subnet for monitoring. The site uplinks to the campus distribution switch through a single router interface (Gig 0/0) that connects to switch port Gi0/1. The VLAN plan is:\n- VLAN 10: Corporate desktops, 192.168.10.0/24\n- VLAN 20: Guest Wi-Fi, 192.168.20.0/24\n- VLAN 60: IoT sensors, 192.168.60.0/25 (isolated from guest and corporate networks)\nThe switch trunk currently only allows VLANs 1-30, and the router has no subinterfaces configured yet.\n\nQUESTIONS:\n1. Provide the CLI sequence for the switch trunk on Gi0/1 and the router subinterfaces so each VLAN receives an encapsulation dot1Q entry, descriptive name, and gateway IP.\n2. What steps keep the parent router interface up while the subinterfaces carry VLAN traffic, and how do you verify the router sees each VLAN tag?\n3. A new security requirement asks for VLAN 50 for surveillance cameras. How do you add that VLAN to the branch, update the trunk, describe the subinterface, and ensure the cameras stay isolated from the other VLANs?\n4. Which show commands on the switch and router prove that VLAN 10, 20, and 60 traffic traverses the trunk and that hosts are using the correct gateways?\n\n================================================================================\nSCENARIO 2: LAYER 3 SWITCH CORE FOR THE METRO CAMPUS\n================================================================================\nThe metro campus aggregates five access-layer VLANs and must provide high-throughput inter-VLAN routing plus a reliable path to the internet. VLANs are: VLAN 10 (Sales), VLAN 20 (Engineering), VLAN 30 (Finance), VLAN 40 (Voice), and VLAN 99 (Management). The Layer 3 switch connects to the internet via a routed uplink (203.0.113.254) and to redundant distribution switches with trunks.\n\nQUESTIONS:\n1. Describe the configuration steps to enable ip routing, create each VLAN, and build SVIs with meaningful descriptions and gateway IPs.\n2. What CLI ensures the SVIs stay up even when no hosts are yet connected, and which show commands confirm the routing table reflects the connected VLAN networks plus the default route to the ISP?\n3. How do you configure the uplink interface to carry the five VLANs, prune unused VLANs, and document the verification commands that show the trunk is passing 802.1Q tags for every SVI?\n4. Explain how you configure a static default route on the switch so every VLAN uses the ISP IP and how you prove the switch can reach 8.8.8.8 from the Vlan20 gateway.\n\n================================================================================\nSCENARIO 3: TROUBLESHOOTING INTER-VLAN ROUTING\n================================================================================\nAfter adding VLAN 70 for R&D labs, users can no longer reach VLAN 20 resources though the VLAN exists. The trunk between the core and distribution switch was changed to allow VLANs 10-50 but VLAN 70 was missed. Additionally, the Layer 3 switch has ip routing disabled and every SVI shows administratively down even though VLAN 20 has ports active.\n\nQUESTIONS:\n1. What are the two root causes of the inter-VLAN outage?\n2. Which commands normalize the trunk allowed VLAN list, enable ip routing, and bring the SVIs for VLAN 20 and 70 up?\n3. Which show commands confirm that VLAN 70 traffic now reaches the core and that ip routing is operational?\n\n================================================================================\nSCENARIO 4: DESIGN DECISIONS FOR NEW CAMPUS BRANCHES\n================================================================================\nMeridian plans two new branches. Branch A is a high-traffic research lab with 250 devices, heavy VLAN-to-VLAN traffic, and a budget for premium hardware. Branch B is a satellite sales office with 35 devices and no in-house routing team.\n\nQUESTIONS:\n1. For Branch A, argue why a Layer 3 switch with SVIs is preferable to router-on-a-stick, citing performance, uplink design, and scaling.\n2. For Branch B, explain why router-on-a-stick may still be the best fit, and describe the documentation you would create to prove the subinterfaces align with VLANs and security zones.\n3. What metrics or signals tell you it is time to convert a router-on-a-stick deployment into Layer 3 switching when traffic grows?\n\n================================================================================\nSCENARIO 5: 802.1Q TAG MONITORING AND NATIVE VLAN MISMATCH\n================================================================================\nAn operations team reports random inter-VLAN connectivity drops. When you inspect the trunk, the access switch uses native VLAN 99 while the router-on-a-stick uplink still uses VLAN 1 as the native VLAN. Both sides allow the same VLANs otherwise. You suspect native VLAN mismatches and missing tags.\n\nQUESTIONS:\n1. How does a native VLAN mismatch cause intermittent drops, and how do you reconcile the mismatch without touching the data VLANs?\n2. Which commands prove which VLAN is native, which ports are trunking 802.1Q, and that the router subinterfaces still receive tagged packets?\n3. After you fix the native VLAN alignment, which verification steps show that VLAN 1 no longer carries user data and that untagged frames are confined to the management VLAN?\n\n================================================================================\nEND OF EXERCISE\n================================================================================",
  "solution": "# Inter-VLAN Routing Lab - Complete Solutions\n# Each scenario answers the questions with professional reasoning and CLI detail.\n\n================================================================================\nSCENARIO 1: ROUTER-ON-A-STICK FOR A COASTAL BRANCH - SOLUTION\n================================================================================\n1. Switch configuration:\n   interface GigabitEthernet0/1\n     description Trunk to Coastal Router\n     switchport mode trunk\n     switchport trunk encapsulation dot1q\n     switchport trunk allowed vlan 10,20,50,60\n     switchport trunk native vlan 99\n     no shutdown\nRouter configuration:\n   interface GigabitEthernet0/0\n     description Trunk to Switch\n     no ip address\n     no shutdown\n   interface GigabitEthernet0/0.10\n     encapsulation dot1Q 10\n     ip address 192.168.10.1 255.255.255.0\n     description Corporate VLAN\n   interface GigabitEthernet0/0.20\n     encapsulation dot1Q 20\n     ip address 192.168.20.1 255.255.255.0\n     description Guest VLAN\n   interface GigabitEthernet0/0.60\n     encapsulation dot1Q 60\n     ip address 192.168.60.1 255.255.255.128\n     description IoT Sensors\n   ip route 0.0.0.0 0.0.0.0 203.0.113.254\n\n2. Keeping the parent interface up requires the physical interface to be in no shutdown state with no IP (because the subinterfaces handle addressing). Verify with `show ip interface brief` to confirm GigabitEthernet0/0 is up/up and the subinterfaces have the expected addresses. Monitor `show controllers` or `show interface trunk` on the switch to see 802.1Q frames arriving on each VLAN. The trunk output lists VLAN numbers so you know the router sees the tags.\n\n3. Add VLAN 50 everywhere:\n   switch(config)# vlan 50\n     name CAMERAS\n   interface GigabitEthernet0/1\n     switchport trunk allowed vlan add 50\n   router(config)# interface GigabitEthernet0/0.50\n     encapsulation dot1Q 50\n     ip address 192.168.50.1 255.255.255.0\n     description Surveillance VLAN\n   router(config-if)# exit\nCameras remain isolated because they use their own subinterface, and the trunk now allows VLAN 50 without touching VLAN 10 or 20. Use ACLs on the subinterface if more isolation is required.\n\n4. Verification commands on the switch: `show interfaces trunk` to confirm VLAN 10, 20, 50, and 60 are allowed and `show vlan brief` to prove access ports stay in their data VLANs. On the router, `show ip interface brief` and `show interface GigabitEthernet0/0.20 switchport` (if available) show each subinterface is up and assigned. The hosts should list their default gateway as the subinterface IP, and `ping 192.168.60.1` from the switch validates the router is reachable.\n\n================================================================================\nSCENARIO 2: LAYER 3 SWITCH CORE FOR THE METRO CAMPUS - SOLUTION\n================================================================================\n1. Enable routing and create SVIs:\n   ip routing\n   vlan 10\n     name SALES\n   vlan 20\n     name ENGINEERING\n   vlan 30\n     name FINANCE\n   vlan 40\n     name VOICE\n   vlan 99\n     name MANAGEMENT\n   interface Vlan10\n     description Sales Gateway\n     ip address 192.168.10.1 255.255.255.0\n     no shutdown\n   interface Vlan20\n     description Engineering Gateway\n     ip address 192.168.20.1 255.255.255.0\n     no shutdown\n   interface Vlan30\n     description Finance Gateway\n     ip address 192.168.30.1 255.255.255.0\n     no shutdown\n   interface Vlan40\n     description Voice Gateway\n     ip address 192.168.40.1 255.255.255.0\n     no shutdown\n   interface Vlan99\n     description Management Gateway\n     ip address 10.99.99.1 255.255.255.0\n     no shutdown\n\n2. Ensure SVIs stay up even without hosts by configuring the interface description and `no shutdown`. The management VLAN can have a loopback or static host to keep it alive. Use `show ip interface brief` to confirm each SVI is up/up, and `show ip route` to prove the switch has connected routes for 192.168.10.0/24, 192.168.20.0/24, 192.168.30.0/24, 192.168.40.0/24, and 10.99.99.0/24. The `show ip route` output also shows the default route once it exists.\n\n3. Configure the uplink trunk:\n   interface GigabitEthernet1/0/1\n     description Trunk to Distribution Switch\n     switchport trunk encapsulation dot1q\n     switchport mode trunk\n     switchport trunk allowed vlan 10,20,30,40,99\n     switchport trunk native vlan 99\n     no shutdown\nThe `show interfaces trunk` command lists the allowed VLANs and shows each VLAN is operational on that trunk, confirming 802.1Q tags cross the link. `show interfaces GigabitEthernet1/0/1` also displays encapsulation raised to dot1q and indicates the native VLAN.\n\n4. Default route and verification:\n   ip route 0.0.0.0 0.0.0.0 203.0.113.254\n`show ip route` now lists 0.0.0.0/0 via 203.0.113.254, and you can test reachability with `ping 8.8.8.8 source 192.168.20.1` to prove the Vlan20 gateway can reach the internet. The trunk keeps passing VLAN tags, so each VLAN still uses the Layer 3 switch as its gateway while the router uplink handles transit.\n\n================================================================================\nSCENARIO 3: TROUBLESHOOTING INTER-VLAN ROUTING - SOLUTION\n================================================================================\n1. Root causes: VLAN 70 was omitted from the trunk allowed list, so its tagged traffic never reaches the core. Additionally, ip routing was disabled, so no SVIs could route between VLANs even though the VLAN interfaces existed.\n\n2. Fix commands:\n   interface GigabitEthernet1/0/1\n     switchport trunk allowed vlan add 70\n   exit\n   ip routing\n   interface Vlan20\n     no shutdown\n   interface Vlan70\n     description R&D Gateway\n     ip address 192.168.70.1 255.255.255.0\n     no shutdown\n`ip routing` enables the hardware routing table, and raising the SVIs allows the switch to advertise those subnets.\n\n3. Verification: `show interfaces trunk` confirms VLAN 70 is now in the allowed list, while `show ip interface brief` shows Vlan20 and Vlan70 are up/up. `show ip route connected` proves the switch advertises the 192.168.70.0/24 network as directly connected. A host on VLAN 70 can now ping 192.168.20.5, showing the routing path is active.\n\n================================================================================\nSCENARIO 4: DESIGN DECISIONS FOR NEW CAMPUS BRANCHES - SOLUTION\n================================================================================\n1. Branch A deserves a Layer 3 switch because the campus already sees massive east-west traffic. SVIs on the switch keep traffic in hardware and avoid the single-trunk bottleneck that router-on-a-stick introduces. The switch can also handle redundant uplinks and maintain a resilient routing table for dozens of VLANs. Its built-in ASIC routing keeps latency low for the heavy labs that need constant inter-VLAN transfers.\n\n2. Branch B is small and can rely on a router-on-a-stick. One physical interface with multiple subinterfaces is easier to manage and cheaper to procure. I would document the VLAN-to-subinterface mapping in a change control log, including VLAN IDs, subinterface names, gateway IPs, and descriptions (e.g., `Gig0/0.15 Encapsulation dot1Q 15 - Sales`). That documentation proves each security zone maps correctly to the functional VLANs and helps future teams verify the configuration quickly.\n\n3. Signals that it is time to switch to Layer 3 switching include sustained trunk utilization nearing 90%, frequent trunk errors or collisions on the router interface, or a requirement for multiple redundant uplinks that a router cannot easily support. A sudden increase in VLAN count or internal traffic causing the router-on-a-stick link to saturate means the hardware must move closer to the access layer and use SVIs instead.\n\n================================================================================\nSCENARIO 5: 802.1Q TAG MONITORING AND NATIVE VLAN MISMATCH - SOLUTION\n================================================================================\n1. A native VLAN mismatch causes the router to treat untagged frames as VLAN 1 while the switch tags them as VLAN 99. When VLAN 99 is expected to carry management traffic and VLAN 1 is untouched, the router silently drops the untagged frames or assigns them to the wrong VLAN. Fix the mismatch by setting `switchport trunk native vlan 1` on the switch to match the router or, preferably, change both sides to use a dedicated management VLAN like 99 and avoid VLAN 1 entirely.\n\n2. Commands: `show interfaces trunk` on the switch prints the native VLAN and the VLANs currently trunking. `show interface Gi0/1 switchport` reveals whether the port is in access or trunk mode and lists the native VLAN. On the router, `show interface GigabitEthernet0/0 trunk` (or `show interface GigabitEthernet0/0.10` etc.) demonstrates that each subinterface receives tagged traffic. `debug dot1q` (where supported) can show actual tag processing.\n\n3. After matching the native VLANs, the verification steps include `show vlan brief` to prove VLAN 1 has no user ports and is reserved for infrastructure, and `show interfaces trunk` to ensure untagged traffic is tied to VLAN 99 only. Running `show ip interface brief` on the router confirms no hosts are using the VLAN 1 gateway, while management tools tied to VLAN 99 remain reachable.\n\n================================================================================\nEND OF SOLUTIONS\n================================================================================",
  "hints": [
    "Always align your trunk allowed VLAN list with the subinterfaces configured on the router before testing connectivity.",
    "Keep the router physical interface in no shutdown state with no IP address so every subinterface owns its subnet.",
    "Use descriptive names and `no shutdown` on each SVI so the interfaces stay up even before hosts come online.",
    "`ip routing` must be enabled on Layer 3 switches before SVIs can route between VLANs.",
    "`show interfaces trunk` and `show ip interface brief` are your go-to verification commands for trunk health and SVI status.",
    "Document VLAN-to-subinterface mappings so future teams understand which VLAN uses which default gateway.",
    "A missing VLAN on a trunk looks like a routing failure; first confirm the VLAN is allowed and then check ip routing.",
    "When VLAN traffic saturates a 1 Gbps trunk, consider moving to Layer 3 switching to eliminate the bottleneck.",
    "Pruning VLANs on a trunk reduces unnecessary flooding and keeps 802.1Q tagging predictable.",
    "A native VLAN mismatch can drop untagged frames—standardize the native VLAN on both ends of a trunk.",
    "Use `show ip route connected` to prove each VLAN advertises as a directly connected network in the hardware routing table.",
    "Monitor untagged and tagged frame behavior with `show interface trunk` so the management VLAN stays distinct from VLAN 1."
  ],
  "testCases": [
    {
      "id": "tc1",
      "description": "Confirms router-on-a-stick terminology is present",
      "validation": "assert 'router-on-a-stick' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc2",
      "description": "Ensures subinterfaces and encapsulation steps are described",
      "validation": "assert 'subinterface' in code.lower() and 'encapsulation dot1q' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc3",
      "description": "Checks that Layer 3 switch configuration and ip routing are explained",
      "validation": "assert 'ip routing' in code.lower() and 'interface vlan' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc4",
      "description": "Verifies trunk verification commands exist",
      "validation": "assert 'show interfaces trunk' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc5",
      "description": "Confirms default route mention",
      "validation": "assert 'ip route 0.0.0.0' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc6",
      "description": "Ensures SVIs and gateway discussion",
      "validation": "assert 'vlan10' in code.lower() or 'interface vlan10' in code.lower() or 'interface vlan 10' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc7",
      "description": "Checks mention of native VLAN alignment",
      "validation": "assert 'native vlan' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc8",
      "description": "Ensures troubleshooting focus on missing VLAN and ip routing",
      "validation": "assert 'missing vlan' in code.lower() or 'ip routing' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc9",
      "description": "Validates verification of management VLAN isolation",
      "validation": "assert 'show vlan brief' in code.lower() or 'management vlan' in code.lower()",
      "isHidden": false
    },
    {
      "id": "tc10",
      "description": "Checks discussion of converting to Layer 3 switching",
      "validation": "assert 'layer 3 switch' in code.lower() and 'router-on-a-stick' in code.lower()",
      "isHidden": false
    }
  ]
}
